{
  "intents": [
    {
      "tag": "Bạn là ai?",
      "patterns": ["Bạn là ai?"],
      "responses": [
        "tôi là một chatbot thông minh được phát triển bởi sinh viên có mã số sinh viên là b1910023"
      ],
      "context": ""
    },
    {
      "tag": "Nhân viên",
      "patterns": [
        "Bạn có phải là nhân viên của cit auction không",
        "Bạn làm việc ở đây bao nhiêu lâu rồi?"
      ],
      "responses": [
        "tôi là nhân viên xuất sắc nhất của cit action ",
        "tôi làm việc ở đây từ khi sinh viên có mã số sinh viên là b1910023 làm luận văn tốt nghiệp "
      ],
      "context": ""
    },
    {
      "tag": "Tuổi tác",
      "patterns": ["Bạn mấy tuổi?", "Tuổi của bạn?"],
      "responses": ["tôi được 3 tháng tuổi"],
      "context": ""
    },
    {
      "tag": "Quê quán",
      "patterns": ["Quê bạn ở đâu"],
      "responses": [
        "Quê tôi ở ổ D trong máy tính của sinh viên có mã số sinh viên là b1910023"
      ],
      "context": ""
    },
    {
      "tag": "Họ tên",
      "patterns": ["Bạn tên gì?", "Tên bạn là gì?", "Họ và tên bạn?"],
      "responses": [
        "tôi cũng không biết tên của tôi nữa bạn đặt tên cho tôi đi "
      ],
      "context": ""
    },
    {
      "tag": "website",
      "patterns": ["Website này là gì?", "Hãy giới thiệu về website?", "Tác dụng của website", "tại sao tôi phải sử dụng website này?"],
      "responses": [
        "Trong bối cảnh thời đại hiện nay, với sự phát triển nhanh chóng và nhu cầu ngày càng cao về sự tiện lợi, ý tưởng xây dựng 'Website đấu giá và chia sẻ đồ dùng cá nhân' xuất phát từ nỗ lực đáp ứng nhu cầu đa dạng của cộng đồng. Việc kết hợp đấu giá trực tuyến và chia sẻ đồ dùng cá nhân không chỉ giúp tối ưu hóa thời gian và chi phí mà còn đóng góp tích cực vào việc bảo vệ môi trường thông qua việc giảm lượng rác thải."
      ]
    },

    {
      "tag": "Thời gian kết thúc",
      "patterns": [
        "Khi nào đấu giá kết thúc?",
        "Thời gian còn lại",
        "Khi nào kết thúc đấu giá?",
        "Sắp kết thúc"
      ],
      "responses": [
        "Thời gian kết thúc đấu giá sẽ được hiển thị cùng với sản phẩm. Hãy theo dõi để không bỏ lỡ cơ hội!"
      ],
      "context": ""
    },
    {
      "tag": "Nhắc nhỡ đấu giá",
      "patterns": [
        "Tôi muốn nhận thông báo đấu giá trước khi nó bất đầu hoặc kết thúc không?",
        "Tôi muốn hẹn giờ đấu giá thì làm sao?",
        "Thông báo cho tôi khi kết thúc đấu giá",
        "Nhắc nhỡ đấu giá"

      ],
      "responses": [
        "Bạn cần vào trang chi tiết sản phẩm mà bạn muốn nhận thông báo, sau đó nhấn vào biểu tượng cái chuông để có thể nhận thông báo đấu giá từ hệ thống trước khi nó bất đầu hoặc kết thúc",
        "bạn vui lòng vào trang chi tiết sản phẩm và nhấn vào biểu tượng cái chuông để nhận thông báo từ sản phẩm này"
      ],
      "context": ""
    },
    {
      "tag": "Thanh toán",
      "patterns": [
        "Tôi có thể thanh toán bằng những cách nào",
        "có mấy loại hình thức thanh toán",
        "Tôi muốn thanh toán bằng chuyển khoản được không"
      ],
      "responses": [
        "trang web của chúng tôi hỗ trợ bạn hai hình thức thanh toán đó là thanh toán trực tiếp khi nhận hàng hoặc thanh toán qua Paypal"
      ],
      "context": ""
    },
    {
      "tag": "Đánh giá",
      "patterns": [
        "Tôi muốn đánh giá người dùng thì làm thế nào",
        " tôi có thể đánh giá người khác không",
        "Tôi muốn đánh giá người bán ",
        "Làm sao để vào trang cửa hàng của người bán"
      ],
      "responses": [
        "Tất nhiên rồi bạn có thể đánh giá người bán khi bạn là người chiến thắng cuộc đấu giá hoặc bạn là người mua trực tiếp sản phẩm bằng cách vào trang cửa hàng của người bán và để lại đánh giá của bạn",
        "Bạn có thể đến cửa hàng của người bán thông qua nút cửa hàng ở mục thông tin của cuộc đấu giá mà bạn đã đấu giá"
      ],
      "context": ""
    },
    {
      "tag": "Email paypal",
      "patterns": [
        "paypal Email là gì",
        "Hãy chỉ tôi cách đăng ký Paypal email",
        "Tôi muốn đăng ký tài khoản Paypal thì làm thế nào"
      ],
      "responses": [
        "hệ thống của chúng tôi chỉ cho phép bạn tham gia các cuộc đấu giá có hình thức thanh toán là chuyển khoản khi bạn có email Paypal",
        "để đăng ký Paypal email  bạn vui lòng vào https://www.paypal.com/ để biết thêm chi tiết"
      ],
      "context": ""
    },
    {
      "tag": "Thông báo đấu giá",
      "patterns": [
        "Tạo thông báo",
        "Thông báo khi kết thúc",
        "Nhận thông báo đấu giá",
        "Báo cho tôi khi kết thúc"
      ],
      "responses": [
        "Bạn có thể nhận thông báo từ các cuộc đấu giá, hãy vào cuộc đấu giá đó và bấm vào biểu tượng cái chuông!"
      ],
      "context": ""
    },
    {
      "tag": "Sản phẩm cụ thể",
      "patterns": [
        "Chi tiết sản phẩm",
        "Thông tin sản phẩm",
        "Đặc điểm sản phẩm",
        "Giá sản phẩm"
      ],
      "responses": [
        "Để biết thông tin chi tiết về sản phẩm, hãy nhấn vào sản phẩm đó và xem chi tiết."
      ],
      "context": ""
    },
    {
      "tag": "Lịch sử đấu giá",
      "patterns": [
        "Lịch sử đấu giá",
        "Sản phẩm đã tham gia",
        "Sản phẩm đã đấu giá",
        "Danh sách đấu giá"
      ],
      "responses": [
        "Bạn có thể xem lịch sử đấu giá trong tài khoản của bạn. Hãy vào quản lí đấu giá để kiểm tra."
      ],
      "context": ""
    },
    {
      "tag": "Giá khởi điểm",
      "patterns": [
        "Giá khởi điểm là bao nhiêu?",
        "Giá ban đầu",
        "Giá bắt đầu",
        "Giá đề xuất"
      ],
      "responses": [
        "Giá khởi điểm là giá ban đầu của sản phẩm trong đấu giá. Bạn có thể xem giá này trên trang sản phẩm."
      ],
      "context": ""
    },
    {
      "tag": "Phí đấu giá",
      "patterns": [
        "Phí đấu giá là bao nhiêu?",
        "Cách tính phí đấu giá",
        "Phí đấu giá tăng dần",
        "Phí tham gia"
      ],
      "responses": [
        "Phí đấu giá thường được tính dựa trên giá trị đấu giá của sản phẩm."
      ],
      "context": ""
    },
    {
      "tag": "Phương thức thanh toán",
      "patterns": [
        "Cách thanh toán",
        "Phương thức thanh toán",
        "Thanh toán khi thắng",
        "Thanh toán an toàn"
      ],
      "responses": [
        "Chúng tôi hỗ trợ nhiều phương thức thanh toán để đảm bảo an toàn cho bạn. Thông tin chi tiết có thể thấy trên trang thanh toán."
      ],
      "context": ""
    },
    {
      "tag": "Chào",
      "patterns": [
        "Xin chào",
        "chaof",
        "hé lô",
        "hi",
        "Chào bạn",
        "Bạn khỏe chứ?",
        "chào",
        "Ngày mới tốt lành"
      ],
      "responses": [
        "Xin chào, chào mừng đến cit auction",
        "Chào bạn nhá!",
        "Xin chào, tôi có thể giúp gì cho bạn?"
      ],
      "context": ""
    },
    {
      "tag": "Tố cáo",
      "patterns": [
        "Tôi có thể tố cáo người khác không",
        "Tôi muốn tố cáo Người bán thì làm thế nào",
        "Tôi muốn tố cáo người mua thì làm thế nào"
      ],
      "responses": [
        "Nếu người bán hoặc người mua có hành vi gian lận bạn có thể tố cáo người đó thông qua các sản phẩm mà bạn đã mua từ người đó chúng tôi sẽ xem xét và đưa ra hình phạt hợp lý",
        "tố cáo của bạn sẽ được chúng tôi xem xét và xác minh Nếu đúng như tố cáo của bạn Chúng tôi sẽ đưa ra hình phạt hợp lý"
      ],
      "context": ""
    },
    {
      "tag": "Tìm hiểu về sản phẩm",
      "patterns": [
        "Bạn có sản phẩm nào?",
        "Cho tôi biết về các sản phẩm của bạn",
        "Có gì mới không?"
      ],
      "responses": [
        "Chúng tôi có nhiều sản phẩm hấp dẫn, bạn muốn tìm hiểu về sản phẩm cụ thể nào?",
        "Có sản phẩm từ nhiều danh mục khác nhau. Bạn quan tâm đến loại sản phẩm nào?"
      ],
      "context": ""
    },

    {
      "tag": "Thông tin tài khoản",
      "patterns": [
        "Làm thế nào để cập nhật thông tin tài khoản?",
        "Tôi muốn thay đổi mật khẩu",
        "Cách đổi địa chỉ email"
      ],
      "responses": [
        "Để cập nhật thông tin tài khoản, bạn có thể truy cập vào biểu tượng người dùng ở góc phải trên trang web của chúng tôi. Bạn cần đăng nhập và sẽ có các tùy chọn để cập nhật thông tin cá nhân, mật khẩu và địa chỉ email."
      ],
      "context": ""
    },
    {
      "tag": "Hỏi giá sản phẩm",
      "patterns": [
        "Bao nhiêu tiền?",
        "Giá bao nhiêu?",
        "Giá sản phẩm là bao nhiêu?"
      ],
      "responses": [
        "Giá của sản phẩm cụ thể sẽ khác nhau. Bạn có thể cho tôi biết bạn quan tâm đến sản phẩm nào, để tôi kiểm tra giá cho bạn không?"
      ],
      "context": ""
    },
    {
      "tag": "Hỏi về chính sách đổi trả",
      "patterns": [
        "Chính sách đổi trả của bạn là gì?",
        "Làm thế nào để đổi trả sản phẩm?",
        "Có bao nhiêu ngày để đổi trả?"
      ],
      "responses": [
        "Chính sách đổi trả của chúng tôi cho phép bạn đổi trả sản phẩm trong vòng 30 ngày kể từ ngày mua. Để biết thêm chi tiết, bạn có thể xem Chính sách đổi trả trên trang web của chúng tôi."
      ],
      "context": ""
    },
    {
      "tag": "Hỏi về vận chuyển",
      "patterns": [
        "Làm thế nào để theo dõi đơn hàng?",
        "Bao lâu để nhận sản phẩm sau khi đặt hàng?",
        "Phí vận chuyển là bao nhiêu?"
      ],
      "responses": [
        "Để theo dõi đơn hàng, bạn có thể sử dụng số theo dõi được gửi trong email xác nhận đơn hàng. Thời gian giao hàng và phí vận chuyển có thể khác nhau tùy thuộc vào địa chỉ và sản phẩm. Để biết thêm thông tin cụ thể, bạn có thể liên hệ với dịch vụ khách hàng của chúng tôi hoặc xem thông tin vận chuyển trên trang web."
      ],
      "context": ""
    },

    {
      "tag": "greeting",
      "patterns": [
        "Hi there",
        "How are you",
        "Is anyone there?",
        "Hey",
        "Hola",
        "Hello",
        "Hi",
        "Good day"
      ],
      "responses": [
        "Hello, thanks for asking",
        "Good to see you again",
        "Hi there, how can I help?"
      ],
      "context": [""]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "See you later",
        "Goodbye",
        "Nice chatting to you, bye",
        "Till next time"
      ],
      "responses": [
        "See you!",
        "Have a nice day",
        "Bye! Come back again soon."
      ],
      "context": [""]
    }
  ]
}
